labplus-cn/arduino_esp32_v3_0_0/boards.txt
labplus_Ledong_v2.name=labplus Ledong V2
labplus_Ledong_v2.vid.0=0x303a
labplus_Ledong_v2.pid.0=0x1001
labplus_Ledong_v2.bootloader.tool=esptool_py
labplus_Ledong_v2.bootloader.tool.default=esptool_py

labplus_Ledong_v2.upload.tool=esptool_py
labplus_Ledong_v2.upload.tool.default=esptool_py
labplus_Ledong_v2.upload.tool.network=esp_ota

labplus_Ledong_v2.upload.maximum_size=1310720
labplus_Ledong_v2.upload.maximum_data_size=327680
labplus_Ledong_v2.upload.flags=
labplus_Ledong_v2.upload.extra_flags=
labplus_Ledong_v2.upload.use_1200bps_touch=false
labplus_Ledong_v2.upload.wait_for_upload_port=false

labplus_Ledong_v2.serial.disableDTR=false
labplus_Ledong_v2.serial.disableRTS=false

labplus_Ledong_v2.build.tarch=xtensa
labplus_Ledong_v2.build.bootloader_addr=0x0
labplus_Ledong_v2.build.target=esp32s3
labplus_Ledong_v2.build.mcu=esp32s3
labplus_Ledong_v2.build.core=esp32
labplus_Ledong_v2.build.variant=labplus_Ledong_v2
labplus_Ledong_v2.build.board=LEDONG_V2

labplus_Ledong_v2.build.usb_mode=1
labplus_Ledong_v2.build.cdc_on_boot=1
labplus_Ledong_v2.build.msc_on_boot=0
labplus_Ledong_v2.build.dfu_on_boot=0
labplus_Ledong_v2.build.f_cpu=240000000L
labplus_Ledong_v2.build.flash_size=16MB
labplus_Ledong_v2.build.flash_freq=80m
labplus_Ledong_v2.build.flash_mode=dio
labplus_Ledong_v2.build.boot=qio
labplus_Ledong_v2.build.boot_freq=80m
labplus_Ledong_v2.build.partitions=default
labplus_Ledong_v2.build.defines=
labplus_Ledong_v2.build.loop_core=
labplus_Ledong_v2.build.event_core=
labplus_Ledong_v2.build.psram_type=qspi
labplus_Ledong_v2.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
labplus_Ledong_v2.menu.JTAGAdapter.default=Disabled
labplus_Ledong_v2.menu.JTAGAdapter.default.build.copy_jtag_files=0
labplus_Ledong_v2.menu.JTAGAdapter.builtin=Integrated USB JTAG
labplus_Ledong_v2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
labplus_Ledong_v2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
labplus_Ledong_v2.menu.JTAGAdapter.external=FTDI Adapter
labplus_Ledong_v2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
labplus_Ledong_v2.menu.JTAGAdapter.external.build.copy_jtag_files=1
labplus_Ledong_v2.menu.JTAGAdapter.bridge=ESP USB Bridge
labplus_Ledong_v2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
labplus_Ledong_v2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

labplus_Ledong_v2.menu.PSRAM.enabled=QSPI PSRAM
labplus_Ledong_v2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
labplus_Ledong_v2.menu.PSRAM.enabled.build.psram_type=qspi
labplus_Ledong_v2.menu.PSRAM.disabled=Disabled
labplus_Ledong_v2.menu.PSRAM.disabled.build.defines=
labplus_Ledong_v2.menu.PSRAM.disabled.build.psram_type=qspi
labplus_Ledong_v2.menu.PSRAM.opi=OPI PSRAM
labplus_Ledong_v2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
labplus_Ledong_v2.menu.PSRAM.opi.build.psram_type=opi

labplus_Ledong_v2.menu.FlashMode.qio=QIO 80MHz
labplus_Ledong_v2.menu.FlashMode.qio.build.flash_mode=dio
labplus_Ledong_v2.menu.FlashMode.qio.build.boot=qio
labplus_Ledong_v2.menu.FlashMode.qio.build.boot_freq=80m
labplus_Ledong_v2.menu.FlashMode.qio.build.flash_freq=80m
labplus_Ledong_v2.menu.FlashMode.qio120=QIO 120MHz
labplus_Ledong_v2.menu.FlashMode.qio120.build.flash_mode=dio
labplus_Ledong_v2.menu.FlashMode.qio120.build.boot=qio
labplus_Ledong_v2.menu.FlashMode.qio120.build.boot_freq=120m
labplus_Ledong_v2.menu.FlashMode.qio120.build.flash_freq=80m
labplus_Ledong_v2.menu.FlashMode.dio=DIO 80MHz
labplus_Ledong_v2.menu.FlashMode.dio.build.flash_mode=dio
labplus_Ledong_v2.menu.FlashMode.dio.build.boot=dio
labplus_Ledong_v2.menu.FlashMode.dio.build.boot_freq=80m
labplus_Ledong_v2.menu.FlashMode.dio.build.flash_freq=80m
labplus_Ledong_v2.menu.FlashMode.opi=OPI 80MHz
labplus_Ledong_v2.menu.FlashMode.opi.build.flash_mode=dout
labplus_Ledong_v2.menu.FlashMode.opi.build.boot=opi
labplus_Ledong_v2.menu.FlashMode.opi.build.boot_freq=80m
labplus_Ledong_v2.menu.FlashMode.opi.build.flash_freq=80m

labplus_Ledong_v2.menu.FlashSize.16M=16MB (128Mb)
labplus_Ledong_v2.menu.FlashSize.16M.build.flash_size=16MB
labplus_Ledong_v2.menu.FlashSize.32M=32MB (256Mb)
labplus_Ledong_v2.menu.FlashSize.32M.build.flash_size=32MB

labplus_Ledong_v2.menu.LoopCore.1=Core 1
labplus_Ledong_v2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
labplus_Ledong_v2.menu.LoopCore.0=Core 0
labplus_Ledong_v2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

labplus_Ledong_v2.menu.EventsCore.1=Core 1
labplus_Ledong_v2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
labplus_Ledong_v2.menu.EventsCore.0=Core 0
labplus_Ledong_v2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

labplus_Ledong_v2.menu.USBMode.hwcdc=Hardware CDC and JTAG
labplus_Ledong_v2.menu.USBMode.hwcdc.build.usb_mode=1
labplus_Ledong_v2.menu.USBMode.default=USB-OTG (TinyUSB)
labplus_Ledong_v2.menu.USBMode.default.build.usb_mode=0

labplus_Ledong_v2.menu.CDCOnBoot.cdc=Enabled
labplus_Ledong_v2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
labplus_Ledong_v2.menu.CDCOnBoot.default=Disabled
labplus_Ledong_v2.menu.CDCOnBoot.default.build.cdc_on_boot=0

labplus_Ledong_v2.menu.MSCOnBoot.default=Disabled
labplus_Ledong_v2.menu.MSCOnBoot.default.build.msc_on_boot=0
labplus_Ledong_v2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
labplus_Ledong_v2.menu.MSCOnBoot.msc.build.msc_on_boot=1

labplus_Ledong_v2.menu.DFUOnBoot.default=Disabled
labplus_Ledong_v2.menu.DFUOnBoot.default.build.dfu_on_boot=0
labplus_Ledong_v2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
labplus_Ledong_v2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

labplus_Ledong_v2.menu.UploadMode.default=UART0 / Hardware CDC
labplus_Ledong_v2.menu.UploadMode.default.upload.use_1200bps_touch=false
labplus_Ledong_v2.menu.UploadMode.default.upload.wait_for_upload_port=false
labplus_Ledong_v2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
labplus_Ledong_v2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
labplus_Ledong_v2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

