labplus-cn/arduino_esp32_v3_0_0/boards.txt
labplus_Ledong_v2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
labplus_Ledong_v2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
labplus_Ledong_v2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.default.build.partitions=default
labplus_Ledong_v2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
labplus_Ledong_v2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
labplus_Ledong_v2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
labplus_Ledong_v2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.minimal.build.partitions=minimal
labplus_Ledong_v2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.no_ota.build.partitions=no_ota
labplus_Ledong_v2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
labplus_Ledong_v2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
labplus_Ledong_v2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
labplus_Ledong_v2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
labplus_Ledong_v2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
labplus_Ledong_v2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
labplus_Ledong_v2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
labplus_Ledong_v2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.huge_app.build.partitions=huge_app
labplus_Ledong_v2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
labplus_Ledong_v2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
labplus_Ledong_v2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
labplus_Ledong_v2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.fatflash.build.partitions=ffat
labplus_Ledong_v2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
labplus_Ledong_v2.menu.PartitionScheme.rainmaker=RainMaker 4MB
labplus_Ledong_v2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
labplus_Ledong_v2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
labplus_Ledong_v2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
labplus_Ledong_v2.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
labplus_Ledong_v2.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
labplus_Ledong_v2.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
labplus_Ledong_v2.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
labplus_Ledong_v2.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
labplus_Ledong_v2.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
labplus_Ledong_v2.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
labplus_Ledong_v2.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
labplus_Ledong_v2.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
labplus_Ledong_v2.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
labplus_Ledong_v2.menu.PartitionScheme.custom=Custom
labplus_Ledong_v2.menu.PartitionScheme.custom.build.partitions=
labplus_Ledong_v2.menu.PartitionScheme.custom.upload.maximum_size=16777216

labplus_Ledong_v2.menu.PartitionScheme.factory_4apps=16MB+Factory (4x 3MB APP/2MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.factory_4apps.build.custom_partitions=m5stack_partitions_16MB_factory_4_apps
labplus_Ledong_v2.menu.PartitionScheme.factory_4apps.upload.maximum_size=3145728
labplus_Ledong_v2.menu.PartitionScheme.factory_6apps=16MB+Factory (6x 2MB APP/2MB SPIFFS)
labplus_Ledong_v2.menu.PartitionScheme.factory_6apps.build.custom_partitions=m5stack_partitions_16MB_factory_6_apps
labplus_Ledong_v2.menu.PartitionScheme.factory_6apps.upload.maximum_size=2097152

labplus_Ledong_v2.menu.CPUFreq.240=240MHz (WiFi)
labplus_Ledong_v2.menu.CPUFreq.240.build.f_cpu=240000000L
labplus_Ledong_v2.menu.CPUFreq.160=160MHz (WiFi)
labplus_Ledong_v2.menu.CPUFreq.160.build.f_cpu=160000000L
labplus_Ledong_v2.menu.CPUFreq.80=80MHz (WiFi)
labplus_Ledong_v2.menu.CPUFreq.80.build.f_cpu=80000000L
labplus_Ledong_v2.menu.CPUFreq.40=40MHz
labplus_Ledong_v2.menu.CPUFreq.40.build.f_cpu=40000000L
labplus_Ledong_v2.menu.CPUFreq.20=20MHz
labplus_Ledong_v2.menu.CPUFreq.20.build.f_cpu=20000000L
labplus_Ledong_v2.menu.CPUFreq.10=10MHz
labplus_Ledong_v2.menu.CPUFreq.10.build.f_cpu=10000000L

labplus_Ledong_v2.menu.UploadSpeed.921600=921600
labplus_Ledong_v2.menu.UploadSpeed.921600.upload.speed=921600
labplus_Ledong_v2.menu.UploadSpeed.115200=115200
labplus_Ledong_v2.menu.UploadSpeed.115200.upload.speed=115200
labplus_Ledong_v2.menu.UploadSpeed.256000.windows=256000
labplus_Ledong_v2.menu.UploadSpeed.256000.upload.speed=256000
labplus_Ledong_v2.menu.UploadSpeed.230400.windows.upload.speed=256000
labplus_Ledong_v2.menu.UploadSpeed.230400=230400
labplus_Ledong_v2.menu.UploadSpeed.230400.upload.speed=230400
labplus_Ledong_v2.menu.UploadSpeed.460800.linux=460800
labplus_Ledong_v2.menu.UploadSpeed.460800.macosx=460800
labplus_Ledong_v2.menu.UploadSpeed.460800.upload.speed=460800
labplus_Ledong_v2.menu.UploadSpeed.512000.windows=512000
labplus_Ledong_v2.menu.UploadSpeed.512000.upload.speed=512000

labplus_Ledong_v2.menu.DebugLevel.none=None
labplus_Ledong_v2.menu.DebugLevel.none.build.code_debug=0
labplus_Ledong_v2.menu.DebugLevel.error=Error
labplus_Ledong_v2.menu.DebugLevel.error.build.code_debug=1
labplus_Ledong_v2.menu.DebugLevel.warn=Warn
labplus_Ledong_v2.menu.DebugLevel.warn.build.code_debug=2
labplus_Ledong_v2.menu.DebugLevel.info=Info
labplus_Ledong_v2.menu.DebugLevel.info.build.code_debug=3
labplus_Ledong_v2.menu.DebugLevel.debug=Debug
labplus_Ledong_v2.menu.DebugLevel.debug.build.code_debug=4
labplus_Ledong_v2.menu.DebugLevel.verbose=Verbose
labplus_Ledong_v2.menu.DebugLevel.verbose.build.code_debug=5

labplus_Ledong_v2.menu.EraseFlash.none=Disabled
labplus_Ledong_v2.menu.EraseFlash.none.upload.erase_cmd=
labplus_Ledong_v2.menu.EraseFlash.all=Enabled
labplus_Ledong_v2.menu.EraseFlash.all.upload.erase_cmd=-e
